### Week 2 continued

In [1]:
import pandas as pd
import numpy as np

You can produce dataframes in various ways including: Combining series, combining dictionaries.

In [2]:
s1 = pd.Series({'name': 'Elvis',
                'item purchased': 'Rhinestones',
                'cost': '12.65'})
s2 = pd.Series({'name': 'Priscilla',
                'item purchased': 'Hairspray',
                'cost': '1.65'})
s3 = pd.Series({'name': 'Michael',
                'item purchased': 'Nose Job',
                'cost': '23456'})

Note that when making the dataframe both row and col indices can be non-unique

In [3]:
purchase = pd.DataFrame([s1, s2, s3], index=['Store 1', 'Store 1', 'Store 2'])

In [4]:
purchase

          cost item purchased       name
Store 1  12.65    Rhinestones      Elvis
Store 1   1.65      Hairspray  Priscilla
Store 2  23456       Nose Job    Michael

When querying with one parameter using iloc and loc on dataframes you get a series if there is only one index item to return.

Querying for the repeated index produces a dataframe of that repeated index

In [5]:
purchase.loc['Store 1']

          cost item purchased       name
Store 1  12.65    Rhinestones      Elvis
Store 1   1.65      Hairspray  Priscilla

In [6]:
purchase.loc['Store 2']

cost                 23456
item purchased    Nose Job
name               Michael
Name: Store 2, dtype: object

In [7]:
purchase['item purchased']

Store 1    Rhinestones
Store 1      Hairspray
Store 2       Nose Job
Name: item purchased, dtype: object

Two arguements to loc gets the row and col

In [8]:
purchase.loc['Store 1', 'cost']

Store 1    12.65
Store 1     1.65
Name: cost, dtype: object

What if we want a whole column. Various options:

    1) transpose (but is ugly)
    
    2) straight out index as all columns have a name

In [9]:
purchase.T.loc['cost']

Store 1    12.65
Store 1     1.65
Store 2    23456
Name: cost, dtype: object

In [10]:
purchase['cost']

Store 1    12.65
Store 1     1.65
Store 2    23456
Name: cost, dtype: object

You can chain loc/iloc and indexing

In [11]:
purchase.loc['Store 1']['cost']

Store 1    12.65
Store 1     1.65
Name: cost, dtype: object

However chaining comes at a cost.  Tends to produce copies of the dataframe.

Particularly when changing values, its better to use various arguements to .loc


The below shows that you provide a : to slice all rows, and the second arguement can be a list of columns.

In [12]:
purchase.loc[:,['cost', 'name']]

          cost       name
Store 1  12.65      Elvis
Store 1   1.65  Priscilla
Store 2  23456    Michael

In [13]:
purchase.loc['Store 2', 'name'] = 'Lisa Marie'

In [14]:
purchase

          cost item purchased        name
Store 1  12.65    Rhinestones       Elvis
Store 1   1.65      Hairspray   Priscilla
Store 2  23456       Nose Job  Lisa Marie

In the pandas world, friends dont let friends chain calls!

Remember, panda dataframes are just a 2-axis labelled array

### dropping data

note, this returns a df with the data dropped - it doesnt change the df

In [15]:
purchase.drop('Store 1')

          cost item purchased        name
Store 2  23456       Nose Job  Lisa Marie

In [16]:
purchase

          cost item purchased        name
Store 1  12.65    Rhinestones       Elvis
Store 1   1.65      Hairspray   Priscilla
Store 2  23456       Nose Job  Lisa Marie

drop has 2 interesting parameters:
    
    inplace (if True then will actually work on the df
    axes (default to 0, deals with rows.  If you change to 1 then cols)

Can delete columns using del - note this directly works on the original df!

In [18]:
copy_df = purchase.copy()
del copy_df['name']
copy_df

          cost item purchased
Store 1  12.65    Rhinestones
Store 1   1.65      Hairspray
Store 2  23456       Nose Job

### adding a column

In [19]:
purchase['location'] = None

In [20]:
purchase

          cost item purchased        name location
Store 1  12.65    Rhinestones       Elvis     None
Store 1   1.65      Hairspray   Priscilla     None
Store 2  23456       Nose Job  Lisa Marie     None

In [21]:
purchase['poulet'] = [1,2,3]

In [22]:
purchase

          cost item purchased        name location  poulet
Store 1  12.65    Rhinestones       Elvis     None       1
Store 1   1.65      Hairspray   Priscilla     None       2
Store 2  23456       Nose Job  Lisa Marie     None       3